package com.example.diplom.db

import android.content.Context
import android.database.sqlite.SQLiteDatabase
import com.example.diplom.DatabaseHelper
import android.database.sqlite.SQLiteOpenHelper

class insertData(context: Context) {
    private val databaseHelper: DatabaseHelper = DatabaseHelper(context)

    fun fillData(){
        val db = databaseHelper.writableDatabase
        fillTableWithData(db)
    }
    fun fillTableWithData(db: SQLiteDatabase){
        db.execSQL("insert into UnitMeasurements(UnitMeasurement, Abbreviation) values ('Миллилитр', 'мл'), " +
                                                                                            "('Килограмм', 'кг')," +
                                                                                            "('Грамм', 'гр')," +
                                                                                            "('Таблетка', 'таб')," +
                                                                                            "('Штука', 'шт')," +
                                                                                            "('Упаковка', 'уп')" )

        db.execSQL("insert into ProductTypes(Title) values ('Ветеренарные препараты')," +
                                                                "('Пробиотические добавки')," +
                                                                "('Ароматические добавки')," +
                                                                "('Комплексы витаминов')," +
                                                                "('Спецпредложения')")

        db.execSQL("insert into Products(Title, Description, Volume, UnitMeasurements_id, Price, ProductTypes_id, TitleEng) values" +
                "('Кобактоприм', 'Новейшее антибактериальное средство широкого спектра действия. В 1 см3 препарата в качестве действующего вещества содержится цефкинома сульфат – 29,64 мг (эквивалентно 25,0 мг цефкинома), вспомогательные вещества. Устойчив к гидролизу ,бета-лактамазами, минимальный риск развития дисбактериоза, быстрое достижение максимальной концентрации в плазме крови, первый российский препарат, содержащий цефкином (представитель нового, 4-го поколения цефалоспоринов).', " +
                "'100', '1', '2000', '5', 'kobactoprim')," +
                "('Цефтил', 'Препарат для лечения крупного рогатого скота и свиней при бактериальных инфекциях органов дыхания и желудочно-кишечного тракта. По внешнему виду представляет собой суспензию от белого до кремового цвета. Допускается расслоение при хранении.', " +
                "'100', '1', '620', '5', 'ceftil')," +
                "('Сантомектин', 'Раствор для инъекций крупного рогатого скота, овец, коз, оленей при диктиокаулезе, гемонхозе, остертагиозе, трихостронгилезе, коопериозе, нематодирозе, эзофагостомозе, буностомозе, стронгилоидозе, фасциолезе, телязиозе, гиподерматозе, эстрозе, сифункулятозах, саркоптозе, псороптозе и хориоптозе.', " +
                "'100', '1', '705', '1', 'santomectin')," +
                "('Активитон', 'Раствор для инъекций. Предназначен для животных как тонизирующее средство, молодняку для повышения сопротивляемости организма.', " +
                "'100', '1', '800', '1', 'activiton')," +
                "('Амоксициллин 15% LA', 'Суспензия для инъекцийАнтибактериальный лекарственный препарат группы пенициллина.', " +
                "'100', '1', '700', '1', 'amoxicillin')," +
                "('Детокс флакон', 'Применяют крупному и мелкому рогатому скоту, лошадям, свиньям, собакам, кошкам в составе комплексного лечения заболеваний, связанных с интоксикациями различного происхождения (послеоперационная, онкологическая, в связи с почечной и печёночной недостаточностью); кормовыми отравлениями; ацетонурией; инфекционными и вирусными заболеваниями, протекающими с интоксикацией; микотоксикозами; пролежнями; нарушениями обмена веществ.', " +
                "'100', '1', '350', '1', 'detox')," +
                "('Эндофорс', 'Стабилизация микрофлоры кишечника; Повышение ферментативной активности; Стабилизация электролитного обмена; Подавление возбудителей заболеваний.', " +
                "'25', '2', '7500', '5', 'endoforce')," +
                "('Битацел', 'Профилактика и снятие синдрома ацидоза, нарушений пищеварения, для лучшего усвоения кормов сельскохозяйственных животных и птиц.', " +
                "'25', '2', '6500', '5', 'bitacel')," +
                "('Пентапрол', 'Заселение полезными микроорганизмами нормофлоры кишечника у сельскохозяйственной птицы и свиней после применения антибиотиков;опережающее заселение полезной микрофлорой кишечника у молодняка с первых дней жизни;увеличение сохранности и повышение продуктивности организма;профилактика/лечение диареи и дисбактериозов;стимуляция здоровых обменных процессов в организме и увеличение конверсии кормов;усиления неспецифического иммунитета и стабилизация микрофлоры кишечника.', " +
                "'1000', '1', '5000', '2', 'pentaprol')," +
                "('Эмпробио', 'Пробиотический комплекс эмпробио используется в качестве кормовой добавки для нормализации пищеварения у мелких домашних животных (кошек, собак, грызунов, декоративных животных, птиц и т. д.). Пробиотик эмпробио оказывает профилактику расстройств желудочно-кишечного тракта (гастриты, гастроэнтериты, запоры, диареи, проктиты, диспепсию, желтушность), а также болезней, вызванные сальмонеллой, стафилококками, кишечной палочкой и др. бактериями, быстро снимает симптомы диареи, запоров и прочих расстройств ЖКТ.', " +
                "'100', '1', '280', '2', 'embrobio')," +
                "('Профорт', 'Пробиотик Профорт сочетает в себе свойства фермента и способствует расщеплению клетчатки, улучшению переваривания и усвояемости питательных веществ, снижению вязкости химуса, а также стимулированию размножения полезных бактерий в кишечнике, которые расщепляют целлюлозу. Пробиотик Профорт подходит для всех возрастов, пород и размеров кошек и собак, а также для щенков и взрослых собак мелких пород, взрослых собак крупных и средних пород, котят и кошек.', " +
                "'8', '4', '370', '2', 'profort')," +
                "('Ветоспорин-Ж', 'Пробиотик Помоги стареющей собаке - это лечебно-профилактическая кормовая добавка. Применение пробиотика Ветоспорин Ж позволяет отказаться от применения антибиотиков, гормонов, стимуляторов роста.', " +
                "'100', '1', '235', '2', 'vetosporin')," +
                "('Молочный Мастер', 'Разработан специально для развития преджелудков и нормализации рубцового пищеварения, укрепления иммунитета и повышения скорости роста. В состав помимо всех необходимых для роста и развития теленка витаминов и минеральных веществ входят живые пробиотические культуры. Они повышают активность полезной микрофлоры, нормализуют процессы пищеварения в рубце, стимулируют развитие преджелудков, улучшают переваримость и усвоение питательных веществ корма, предотвращают развитие дисбактериоза и диспепсии, обеспечивают профилактику дисфункции ЖКТ телят. Баланс по кальцию и фосфору обеспечивает хорошее развитие скелета и быстрый рост молодняка.', " +
                "'800', '3', '470', '5', 'dairy_master')," +
                "('Кальций+', 'Для всех видов сельскохозяйственных животных, для птицы всех видов. Состав: кальций, фосфор, сера, марганец, витамин Dз, ферменты, ароматизатор. не содержит гормонов, антибиотиков ГМО. Норма ввода: животным - 3% от массы корма; птице - по поедаемости; 1 ст. ложка = 10 г. Метод вода: животным - смешать с кормом. не вводить в горячий корм. птице - в отдельной кормушке.', " +
                "'2', '2', '2000', '5', 'calcium')," +
                "('Ковелос Сорб', 'Кормовая добавка Ковелос Сорб - это высококачественный продукт для сельскохозяйственных животных и птиц, состоящий из компонента, который является эффективным сорбционным средством - аморфного диоксида кремния с высокоразвитой поверхностью. Добавка химически нейтральна и может смешиваться с разными составами кормового назначения (кормовые добавки, премиксы, витаминно-минеральные добавки). Нейтрализация токсинов начинается уже на этапе ввода добавки в корм.', " +
                "'500', '3', '535', '3', 'kovelos_sorb')," +
                "('Ковелос Сорб+', 'Кормовая добавка Ковелос Сорб+ - премикс для крс, а так же сельскохозяйственных животных и птицы. Ковелос Сорб+ - это высококачественный продукт, состоящий из компонента, который является эффективным сорбционным средством - аморфного диоксида кремния с высокоразвитой поверхностью. Он благотворно влияет на пищеварительную микрофлору и хорошо выводится из организма.', " +
                "'500', '3', '240', '3', 'kovelos_sorb_plus')," +
                "('Карамельный', 'Кормовая добавка в комбикорм Ковелос Ароматизатор для повышения поедаемости кормов и увеличения продуктивности всех видов сельскохозяйственных животных и птицы. В премиксах использованы компоненты высокого пищевого качества. В состав добавок входят натуральные ароматизаторы. Используется как кормовая добавка для кур, свиней, коров, кроликов, овец и коз добавлением в комбикорм, премиксы и витаминно минеральные добавки путем смешивания.', " +
                "'400', '3', '650', '3', 'caramel')," +
                "('Чесночный', 'Кормовая добавка в комбикорм Ковелос Ароматизатор для повышения поедаемости кормов и увеличения продуктивности всех видов сельскохозяйственных животных и птицы. В премиксах использованы компоненты высокого пищевого качества. В состав добавок входят натуральные ароматизаторы. Используется как кормовая добавка для кур, свиней, коров, кроликов, овец и коз добавлением в комбикорм, премиксы и витаминно минеральные добавки путем смешивания.', " +
                "'300', '3', '400', '3', 'garlic')," +
                "('Unitabs Prebiotic', 'Кормовая добавка для собак и кошек любого возраста и породы, которая содержит коэнзим Q10 и другие элементы, необходимые для оптимизации пищеварения и укрепления иммунитета. Сухое молоко и пшеничные отруби придутся по вкусу даже привередливому питомцу. Инулин стимулирует рост и активность бифидо- и лактобактерий и поддерживает их нормальную популяцию в кишечнике. Сухое обезжиренное молоко — источник витаминов А и витаминов группы В, минеральных веществ и незаменимых аминокислот, необходимых для жизнедеятельности организма.', " +
                "'100', '4', '330', '5', 'unitabs_prebiotic')," +
                "('Unitabs SeniorComplex', 'После 7 лет жизни собака считается пожилой, в её организме происходят изменения: замедляется обмен веществ, снижается иммунитет, могут обостряться хронические заболевания. Полноценные комплексные витамины Unitabs SeniorComplex поддержат здоровье вашей собаки.', " +
                "'100', '4', '900', '5', 'unitabs_senior_complex')," +
                "('АртроГликан', 'Хондропротектор нового поколения, улучшает состояние печени и сердца. Артрогликан обладает хондропротективным, анальгезирующим, противовоспалительным действиями, антиоксидантной активностью; укрепляет стенки капилляров.', " +
                "'30', '5', '600', '4', 'arthro_glycan')," +
                "('Эвиталия-Вет', 'Кормовая добавка, уникальный комплекс пробиотических культур и пребиотиков (синбиотик) для нормализации микрофлоры кишечника.', " +
                "'30', '4', '650', '4', 'evitalia')," +
                "('Катазалан', 'Витаминно-стимулирующий лекарственный препарат по внешнему виду представляет собой прозрачную жидкость от розового до красного цвета. Препарат выпускают в стеклянных флаконах по 100 мл. Состав: В 1 мл раствора в качестве активного действующего вещества содержится 100 мг бутафосфана и 0,05 мг цианокобаламина (витамин В12).', " +
                "'100', '1', '460', '4', 'katazalan')," +
                "('Витаспорин', 'Жидкий пробиотический кормовой концентрат для кошек собак, применяется для восстановления ЖКТ кошек и собак, с целью предупреждения диареи различной этиологии, дисбактериозов и желудочно-кишечных заболеваний. Споровые бактерии, входящие в состав Витаспорина помогают расщеплению питательных компонентов кормов, обогащают корма витаминами и аминокислотами, продуцируя антибиотики полипептидной природы, гидролитические ферменты, витамины, аминокислоты и другие биологически активные вещества.', " +
                "'100', '1', '200', '4', 'vitasporin')," +
                "('Азитронит', 'Первый высокоэффективный безопасный антибиотик на основе азитромицина для лечения и метафилактики респираторных, желудочно-кишечных и других инфекций животных.', " +
                "'100', '1', '1950', '1', 'azitonit')," +
                "('Солютаб', 'По внешнему виду Азитронит Солютаб представляет собой плоские круглые таблетки от светло-оранжевого до розово-оранжевого цвета, допускаются более темные или светлые вкрапления. Поверхность таблеток гладкая, с фаской, двумя разделительными бороздками на одной стороне и логотипом на другой стороне.', " +
                "'20', '4', '450', '1', 'solutab')," +
                "('Альвет', 'Безопасное средство для борьбы с инвазионными болезнями сельскохозяйственных животных и птиц, обладающее повышенной биодоступностью за счет оригинальной технологии и рецептуры.', " +
                "'500', '3', '1400', '1', 'alvet')," +
                "('Амоксигард WS', 'Комбинированный водорастворимый препарат на основе амоксициллина и клавулановой кислоты, преодолевающий резистентность к бета-лактамам. По внешнему виду Амоксигард WS представляет собой порошок от светло-желтого до желтого цвета.', " +
                "'1', '2', '1800', '1', 'amoksigard')," +
                "('Вемелкам', 'Вемелкам селективный нестероидный противовоспалительный препарат применяют собакам и кошкам в качестве противовоспалительного, обезболивающего и жаропонижающего средства для начальной терапии и краткосрочного симптоматического лечения при акушерско-гинекологических, урологических, респираторных патологиях, а также при острых и хронических заболеваниях опорно-двигательного аппарата и мягких тканей, сопровождающихся болью, воспалением и нарушением функции', " +
                "'20', '1', '770', '1', 'vemelkam')," +
                "('Диастатин', 'Диастатин - комплексный регидратант для быстрой нормализации пищеварения при диарее поросят и телят с первых дней жизни. Продукт по внешнему виду представляет собой суспензию от белого до желто-коричневого цвета. ', " +
                "'500', '1', '2000', '1', 'diastatin')," +
                "('Viyo Reinforces', 'Напиток-пребиотик для кошек представляет собой эффективное средство для лечения и профилактики заболеваний желудочно-кишечного тракта. Входящие в состав средства натуральные ингредиенты способствуют повышению иммунного ответа организма при угрозе вирусных и инфекционных заболеваний, а также являются великолепным способом компенсировать важнейшие и незаменимые органические соединения.', " +
                "'30', '1', '125', '2', 'viyo')," +
                "('Okvet Expresstabs', 'ЭкспрессТабс для собак весом от 2,5 до 5 кг - комбинированный противопаразитарный препарат для собак, предназначенный для защиты Вашего питомца от эктопаразитов и гельминтов, лечения паразитарных заболеваний, вызываемых блохами, иксодовыми клещами, вшами, чесоточными и тромбидиформными клещами, нематодами и цестодами, для профилактики дирофиляриоза, а также для снижения риска заражения бабезиозом и боррелиозом, переносчиками которых являются иксодовые клещи.', " +
                "'2', '4', '530', '2', 'okvet')," +
                "('Проколин', 'Про-Колин пробиотическая кормовая добавка для нормализации микрофлоры желудочно-кишечного тракта и стимуляции обменных процессов у собак и кошек.', " +
                "'60', '1', '1600', '2', 'prokolin')," +
                "('Синбиотик', 'Для восстановления и поддержания оптимальной кишечной микрофлоры в кишечнике питомцев ветеринарные врачи рекомендуют использовать современный и высокоэффективный препарат Протексин Синбиотик DC. Каждая капсула содержит не менее 2 млн бактерий, способных поддерживать хрупкое равновесие микрофлоры и активизировать работу иммунной системы.', " +
                "'50', '5', '2000', '5', 'sinbiotik')," +
                "('Sirius Premium', 'Сухая ароматическая добавка премиум класса для питания собак крупных пород. Высокое содержание витаминов для поддержания здоровья и биозащита организма. Комплекс пробиотиков 4-го поколения  PROSTOR + нормализует пищеварение и укрепляет иммунитет. Омега 3 и Омега 6 способствуют поддержанию здоровья сердца, мозга, нервной системы, здоровья кожи и красоты шерсти. Содержит хондропротекторы для укрепления суставов.', " +
                "'15', '2', '5500', '3', 'sirius1')," +
                "('Sirius TM', 'Ароматическая добавка SIRIUS премиум класса. Повышенное содержание витаминов для поддержания здоровья собаки и биозащита организма. Особенность добавки SIRIUS - функция ProStor Bio Care.', " +
                "'15', '2', '4400', '3', 'sirius2')," +
                "('Sirius для стериализованных', 'Сухая ароматическая добавка премиум класса для рациона стерилизованных кошек. 4-тое поколения PROSTOR+ нормализует пищеварение и укрепляет иммунитет. Омега 3 и Омега 6 способствуют поддержанию здоровья сердца, мозга, нервной системы, здоровья кожи и красоты шерсти.', " +
                "'400', '3', '350', '5', 'sirius3')," +
                "('Sirius Premium', 'Сухая ароматическая добавка премиум класса для питания взрослых кошек с чувствительным пищеварением. 4-тое поколения PROSTOR+ нормализует пищеварение и укрепляет иммунитет. Омега 3 и Омега 6 способствуют поддержанию здоровья сердца, мозга, нервной системы, здоровья кожи и красоты шерсти. Черника обладает бактерицидными свойствами и способствует обновлению клеток.', " +
                "'400', '3', '340', '3', 'sirius4')," +
                "('Sirius Premium', 'Особенность ароматической добавки  - функция ProStor Bio Care. Функция ProStor Bio Care – это комплекс пробиотиков и пребиотиков четвертого поколения, способствующий восстановлению микрофлоры кишечника. Комплекс создает бактериальную прослойку, защищая стенки кишечника от проникновения патогенный флоры. Данный комплекс повышает усвоение питательных веществ и поддерживает иммунную систему организма. Поглощает токсины и продукты распада.', " +
                "'15', '2', '4900', '3', 'sirius5')," +
                "('Sirius TM полнорационный', 'Особенность ароматической добавки  - функция ProStor Bio Care. Функция ProStor Bio Care – это комплекс пробиотиков и пребиотиков четвертого поколения, способствующий восстановлению микрофлоры кишечника. Комплекс создает бактериальную прослойку, защищая стенки кишечника от проникновения патогенный флоры. Данный комплекс повышает усвоение питательных веществ и поддерживает иммунную систему организма. Поглощает токсины и продукты распада.', " +
                "'15', '2', '5100', '3', 'sirius6')," +
                "('Polidex: Multivitum Plus', 'Биологические свойства для кошек обусловлены содержанием комплекса витаминов, минералов и аминокислот, необходимых для обеспечения оптимальной жизнедеятельности кошки. Регулирует обменные и стимулирует восстановительные процессы в организме, способствует реабилитации кошки в послеродовой период, повышает иммунитет и устойчивость к инфекциям, улучшает состояние кожи и шерсти. Незаменима при натуральном кормлении. Благотворно влияет на общее состояние кошки, повышает иммунитет.', " +
                "'80', '4', '1300', '4', 'polidex')," +
                "('Beaphar: Vitamine B Complex', 'Улучшает всасывание кальция и фосфора Повышает усвояемость магния, железа, марганца, кобальта и цинка в тонком отделе кишечника Стимулирует образование костного вещества и отложение кальция, фосфора и магния в костях Влияет на обмен углеводов Способствует образованию прочной яичной скорлупы и предупреждает «литье» яиц Состав и фармакологические свойства.', " +
                "'50', '1', '1290', '5', 'beaphar_vitamine')," +
                "('Beaphar: Laveta Super', 'Laveta Super для улучшения состояния шерсти собак. Способствует быстрой и качественной линьке, предотвращает выпадение здоровой шерсти и появление перхоти, снимает зуд кожи, улучшает внешний вид шерсти.', " +
                "'50', '1', '1560', '4', 'beaphar_laveta')," +
                "('Кальфотон', 'В 1 мл Кальфотона в качестве действующих веществ содержится: кальция глюконат – 0,33 г, кальция глицерофосфат – 0,082 г, магния хлорид – 0,042 г и вспомогательные вещества: борная кислота, цитрат натрия безводный, вода для инъекции – до 1 мл.', " +
                "'100', '1', '970', '4', 'calfoton')," +
                "('Фитомины', 'Содержит пивные дрожжи, паровую рыбную муку, лактозу и биологически активные компоненты, предназначена для систематического употребления в составе кормовых рационов кошек. Снижает выраженность аллергических реакций, связанных с кормлением: покраснение и зуд кожи, расстройство пищеварения. Приносит заметное облегчение животному, страдающему от аллергии.', " +
                "'50', '3', '350', '4', 'fitomins')," +
                "('Polidex: Multivitum Plus', 'Поливитаминный комплекс, содержащий витамины, микро и макроэлементы, аминокислоты. Хорошо зарекомендовал себя как витаминная добавка в рацион животного при натуральном кормлении. Данный комплекс способствует нормализации обменных процессов в послеродовой период. Прекрасный результат применения препарата у сук с субинвалюцией матки без применения миотропных средств.', " +
                "'150', '4', '880', '4', 'polidex2')"
        )

        db.execSQL("insert into BankCards(Number, Term, CVV, BankSystem) values('1234 1234 1234 1234', '11/33', '123', 'master')," +
                                                                        "('2200 2200 2200 2200', '01/35', '456', 'visa')," +
                                                                        "('1600 1600 1600 1600', '05/25', '765', 'master')," +
                                                                        "('1300 1300 1300 1300', '07/28', '567', 'visa')" )

        db.execSQL("insert into DeliveryAdresses(City, Street, House, Flat, Comment) values" +
                "('Екатеринбург', 'Проспект Космонавтов', 20, 5, 'Домофон не работает'), " +
                "('Екатеринбург', 'Проспект Космонавтов', 48, 24, '')," +
                "('Екатеринбург', 'Проспект Космонавтов', 2, 1, 'Домофон не работает')," +
                "('Екатеринбург', 'Проспект Космонавтов', 13, 12, '')," +
                "('Екатеринбург', 'Проспект Космонавтов', 48, 39, 'Код от калитки #4390')," +
                "('Екатеринбург', 'Проспект Космонавтов', 69, 17, '')," +
                "('Екатеринбург', 'Улица Баумана', 24, 13, '')," +
                "('Екатеринбург', 'Улица Баумана', 42, 57, 'Домофон не работает')," +
                "('Екатеринбург', 'Улица Баумана', 38, 97, '')," +
                "('Екатеринбург', 'Улица Баумана', 24, 87, 'Код от калитки #3210')," +
                "('Екатеринбург', 'Улица Баумана', 172, 72, '')," +
                "('Екатеринбург', 'Улица Баумана', 13, 37, 'Код от калитки #4120')," +
                "('Екатеринбург', 'Улица Баумана', 17, 75, '')" )

        db.execSQL("insert into Clients(LastName, FirstName, MiddleName, Email, Telephone, Password, VerificationCode) values" +
                "('Блинов', 'Гордей', 'Геннадьевич', 'blin@mail.ru', 89998887766, 'Blin', '123456')," +
                "('Марков', 'Вадим', 'Валерьевич', 'mark@gmail.com', 89997776655, 'Mark', '621544')," +
                "('Романов', 'Оскар', 'Яковлевич', 'test1@gmail.com', 89997776655, 'Mark', '621544')," +
                "('Колесников', 'Валентин', 'Иосифович', 'test2@gmail.com', 89997776655, 'Mark', '621544')," +
                "('Самойлов', 'Ефрем', 'Вениаминович', 'test3@gmail.com', 89997776655, 'Mark', '621544')," +
                "('Королёв', 'Ким', 'Лукьевич', 'test4@gmail.com', 89997776655, 'Mark', '621544')," +
                "('Колобова', 'Агата', 'Леонидовна', 'test5@gmail.com', 89997776655, 'Mark', '621544')," +
                "('Шубина', 'Елена', 'Митрофановна', 'test6@gmail.com', 89997776655, 'Mark', '621544')," +
                "('Данилова', 'Ивонна', 'Геннадиевна', 'test7@gmail.com', 89997776655, 'Mark', '621544')," +
                "('Терентьева', 'Джульетта', 'Борисовна', 'test8@gmail.com', 89997776655, 'Mark', '621544')," +
                "('Карпова', 'Альвина', 'Егоровна', 'test9@gmail.com', 89997776655, 'Mark', '621544')," +
                "('Третьякова', 'Надежда', 'Владиславовна', 'test10@gmail.com', 89997776655, 'Mark', '621544')," +
                "('Елисеева', 'Алёна', 'Витальевна', 'test11@gmail.com', 89997776655, 'Mark', '621544')," +
                "('Миронова', 'Иоланта', 'Ярославовна', 'test12@gmail.com', 89997776655, 'Mark', '621544')," +
                "('Иванков', 'Власий', 'Николаевич', 'ivanko@br.ru', 89995554433, 'ivanko', '154884')" )

        db.execSQL("insert into ClientsDeliveryAddresses(Clients_id, DeliveryAddresses_id) values (1, 1)," +
                                                                                                        "(1, 2)," +
                                                                                                        "(1, 3)," +
                                                                                                        "(2, 7)," +
                                                                                                        "(2, 5)," +
                                                                                                        "(2, 4)," +
                                                                                                        "(2, 6)")

        db.execSQL("insert into ClientsBankCards(Clients_id, BankCards_id) values (1, 1), (1, 2), (1, 3), (1, 4)")

        db.execSQL("insert into LikesClient(Clients_id, Products_id) values (1, 1), (1, 7), (1, 13), (1, 19)")

//        db.execSQL("insert into Reviews(Products_id, Client_id, Score, Dignities, Disadvantages, Comment) values (1, 2, 5, 'Хороший препорат', '-1', 'Comment1')," +
//                                                                                                                    "(1, 3, 5, 'Лучший из представленных', '-2', 'Comment2')," +
//                                                                                                                    "(1, 4, 2, 'нету', 'Нам не подошел', 'Comment3')," +
//                                                                                                                    "(1, 3, 4, '+4', '-4', 'Comment4')," +
//                                                                                                                    "(1, 4, 4, '+5', '-5', 'Comment5')," +
//                                                                                                                    "(1, 3, 4, '+6', '-6', 'Comment6')," +
//                                                                                                                    "(1, 4, 5, '+7', '-7', 'Comment7')")

       db.execSQL("INSERT INTO Reviews(Products_id, Client_id, Score, Dignities, Disadvantages, Comment) VALUES (1, 14, 3, 'Хороший продукт', 'Плохая упаковка', 'Нам не подошел'), " +
               "(1, 3, 4, 'Хороший продукт', 'Сложен в использовании', 'Отличный товар'), " +
               "(1, 10, 2, 'Хороший продукт', 'Быстро ломается', 'Среднее качество'), " +
               "(1, 15, 5, 'Экономичный', 'Сложен в использовании', 'Слишком дорого'), " +
               "(2, 12, 2, 'Отличная упаковка', 'Сложен в использовании', 'Слишком дорого'), " +
               "(2, 14, 2, 'Современный дизайн', 'Сложен в использовании', 'Нам не подошел'), " +
               "(2, 5, 4, 'Высокое качество', 'Устаревший дизайн', 'Среднее качество'), " +
               "(2, 4, 2, 'Отличная упаковка', 'Быстро ломается', 'Не рекомендую'), " +
               "(2, 15, 3, 'Высокое качество', 'Плохая упаковка', 'Среднее качество'), " +
               "(3, 11, 1, 'Хороший продукт', 'Быстро ломается', 'Слишком дорого'), " +
               "(3, 7, 5, 'Хороший продукт', 'Устаревший дизайн', 'Слишком дорого'), " +
               "(3, 5, 1, 'Отличная упаковка', 'Дороговато', 'Лучший из представленных'), " +
               "(3, 10, 1, 'Современный дизайн', 'Быстро ломается', 'Не рекомендую'), " +
               "(4, 7, 4, 'Отличная упаковка', 'Дороговато', 'Среднее качество'), " +
               "(4, 15, 1, 'Современный дизайн', 'Сложен в использовании', 'Отличный товар'), " +
               "(4, 6, 3, 'Высокое качество', 'Сложен в использовании', 'Отличный товар'), " +
               "(5, 13, 5, 'Отличная упаковка', 'Сложен в использовании', 'Нам не подошел'), " +
               "(5, 12, 4, 'Высокое качество', 'Устаревший дизайн', 'Среднее качество'), " +
               "(5, 8, 1, 'Удобен в использовании', 'Плохая упаковка', 'Слишком дорого'), " +
               "(5, 11, 1, 'Высокое качество', 'Сложен в использовании', 'Слишком дорого'), " +
               "(5, 7, 4, 'Современный дизайн', 'Дороговато', 'Не рекомендую'), " +
               "(6, 5, 3, 'Хороший продукт', 'Плохая упаковка', 'Отличный товар'), " +
               "(6, 11, 1, 'Удобен в использовании', 'Быстро ломается', 'Отличный товар'), " +
               "(6, 4, 4, 'Хороший продукт', 'Плохая упаковка', 'Не рекомендую'), " +
               "(6, 2, 5, 'Современный дизайн', 'Дороговато', 'Отличный товар'), " +
               "(6, 14, 4, 'Высокое качество', 'Дороговато', 'Среднее качество'), " +
               "(6, 6, 4, 'Отличная упаковка', 'Плохая упаковка', 'Среднее качество'), " +
               "(7, 9, 3, 'Современный дизайн', 'Устаревший дизайн', 'Слишком дорого'), " +
               "(7, 1, 3, 'Хороший продукт', 'Сложен в использовании', 'Отличный товар'), " +
               "(7, 15, 3, 'Высокое качество', 'Плохая упаковка', 'Отличный товар'), " +
               "(7, 4, 3, 'Удобен в использовании', 'Низкая прочность', 'Нам не подошел'), " +
               "(7, 2, 2, 'Современный дизайн', 'Дороговато', 'Лучший из представленных'), " +
               "(8, 14, 1, 'Отличная упаковка', 'Сложен в использовании', 'Слишком дорого'), " +
               "(8, 13, 2, 'Высокое качество', 'Дороговато', 'Отличный товар'), " +
               "(8, 12, 4, 'Современный дизайн', 'Дороговато', 'Лучший из представленных'), " +
               "(9, 14, 1, 'Отличная упаковка', 'Плохая упаковка', 'Отличный товар'), " +
               "(9, 2, 4, 'Отличная упаковка', 'Низкая прочность', 'Среднее качество'), " +
               "(9, 10, 1, 'Удобен в использовании', 'Низкая прочность', 'Отличный товар'), " +
               "(9, 6, 3, 'Хороший продукт', 'Быстро ломается', 'Среднее качество'), " +
               "(9, 1, 3, 'Хороший продукт', 'Быстро ломается', 'Не рекомендую')" )

        db.execSQL("INSERT INTO Reviews(Products_id, Client_id, Score, Dignities, Disadvantages, Comment) VALUES (10, 9, 5, 'Отличная упаковка', 'Дороговато', 'Нам не подошел'), " +
               "(10, 13, 4, 'Экономичный', 'Низкая прочность', 'Среднее качество'), " +
               "(10, 7, 5, 'Отличная упаковка', 'Дороговато', 'Слишком дорого'), " +
               "(10, 8, 3, 'Удобен в использовании', 'Быстро ломается', 'Слишком дорого'), " +
               "(10, 3, 4, 'Удобен в использовании', 'Устаревший дизайн', 'Не рекомендую'), " +
               "(10, 2, 4, 'Хороший продукт', 'Низкая прочность', 'Не рекомендую'), " +
               "(11, 3, 1, 'Экономичный', 'Низкая прочность', 'Отличный товар'), " +
               "(11, 1, 3, 'Высокое качество', 'Устаревший дизайн', 'Не рекомендую'), " +
               "(11, 10, 5, 'Высокое качество', 'Плохая упаковка', 'Нам не подошел'), " +
               "(12, 15, 2, 'Хороший продукт', 'Дороговато', 'Лучший из представленных'), " +
               "(12, 1, 1, 'Современный дизайн', 'Низкая прочность', 'Отличный товар'), " +
               "(12, 12, 1, 'Хороший продукт', 'Быстро ломается', 'Среднее качество'), " +
               "(12, 7, 3, 'Высокое качество', 'Низкая прочность', 'Не рекомендую'), " +
               "(12, 5, 1, 'Высокое качество', 'Быстро ломается', 'Слишком дорого'), " +
               "(12, 8, 5, 'Удобен в использовании', 'Устаревший дизайн', 'Отличный товар'), " +
               "(13, 15, 3, 'Современный дизайн', 'Дороговато', 'Среднее качество'), " +
               "(13, 4, 4, 'Высокое качество', 'Сложен в использовании', 'Отличный товар'), " +
               "(13, 11, 2, 'Экономичный', 'Устаревший дизайн', 'Слишком дорого'), " +
               "(13, 7, 2, 'Хороший продукт', 'Быстро ломается', 'Не рекомендую'), " +
               "(14, 12, 3, 'Отличная упаковка', 'Сложен в использовании', 'Нам не подошел'), " +
               "(14, 13, 4, 'Высокое качество', 'Быстро ломается', 'Не рекомендую'), " +
               "(14, 9, 3, 'Отличная упаковка', 'Устаревший дизайн', 'Слишком дорого'), " +
               "(14, 1, 1, 'Хороший продукт', 'Сложен в использовании', 'Нам не подошел'), " +
               "(15, 10, 3, 'Хороший продукт', 'Устаревший дизайн', 'Не рекомендую'), " +
               "(15, 2, 3, 'Современный дизайн', 'Плохая упаковка', 'Слишком дорого'), " +
               "(15, 13, 5, 'Удобен в использовании', 'Быстро ломается', 'Среднее качество'), " +
               "(15, 8, 4, 'Хороший продукт', 'Сложен в использовании', 'Лучший из представленных'), " +
               "(15, 14, 1, 'Современный дизайн', 'Дороговато', 'Отличный товар'), " +
               "(15, 9, 3, 'Удобен в использовании', 'Устаревший дизайн', 'Отличный товар'), " +
               "(15, 3, 4, 'Удобен в использовании', 'Устаревший дизайн', 'Среднее качество'), " +
               "(16, 9, 3, 'Отличная упаковка', 'Низкая прочность', 'Среднее качество'), " +
               "(16, 11, 2, 'Экономичный', 'Дороговато', 'Слишком дорого'), " +
               "(16, 10, 1, 'Современный дизайн', 'Плохая упаковка', 'Отличный товар'), " +
               "(16, 14, 2, 'Отличная упаковка', 'Дороговато', 'Среднее качество'), " +
               "(17, 11, 2, 'Хороший продукт', 'Сложен в использовании', 'Нам не подошел'), " +
               "(17, 9, 1, 'Удобен в использовании', 'Сложен в использовании', 'Слишком дорого'), " +
               "(17, 8, 3, 'Отличная упаковка', 'Плохая упаковка', 'Среднее качество'), " +
               "(17, 15, 5, 'Высокое качество', 'Низкая прочность', 'Лучший из представленных'), " +
               "(17, 1, 3, 'Высокое качество', 'Плохая упаковка', 'Не рекомендую'), " +
               "(17, 5, 2, 'Современный дизайн', 'Устаревший дизайн', 'Отличный товар'), " +
               "(17, 13, 3, 'Высокое качество', 'Низкая прочность', 'Лучший из представленных'), " +
               "(18, 12, 4, 'Современный дизайн', 'Устаревший дизайн', 'Нам не подошел'), " +
               "(18, 2, 4, 'Экономичный', 'Низкая прочность', 'Среднее качество'), " +
               "(18, 13, 4, 'Хороший продукт', 'Устаревший дизайн', 'Среднее качество'), " +
               "(18, 6, 3, 'Экономичный', 'Сложен в использовании', 'Среднее качество')" )

        db.execSQL("INSERT INTO Reviews(Products_id, Client_id, Score, Dignities, Disadvantages, Comment) VALUES (19, 7, 4, 'Современный дизайн', 'Сложен в использовании', 'Среднее качество'), " +
               "(19, 2, 2, 'Высокое качество', 'Устаревший дизайн', 'Нам не подошел'), " +
               "(19, 6, 3, 'Высокое качество', 'Дороговато', 'Отличный товар'), " +
               "(19, 1, 2, 'Высокое качество', 'Низкая прочность', 'Среднее качество'), " +
               "(20, 11, 5, 'Удобен в использовании', 'Дороговато', 'Слишком дорого'), " +
               "(20, 10, 1, 'Экономичный', 'Дороговато', 'Нам не подошел'), " +
               "(20, 5, 2, 'Хороший продукт', 'Сложен в использовании', 'Отличный товар'), " +
               "(20, 12, 3, 'Высокое качество', 'Плохая упаковка', 'Нам не подошел'), " +
               "(20, 13, 2, 'Экономичный', 'Сложен в использовании', 'Отличный товар'), " +
               "(20, 3, 3, 'Удобен в использовании', 'Дороговато', 'Отличный товар'), " +
               "(21, 5, 3, 'Хороший продукт', 'Быстро ломается', 'Лучший из представленных'), " +
               "(21, 9, 5, 'Удобен в использовании', 'Низкая прочность', 'Не рекомендую'), " +
               "(21, 10, 5, 'Высокое качество', 'Сложен в использовании', 'Слишком дорого'), " +
               "(21, 3, 3, 'Экономичный', 'Быстро ломается', 'Среднее качество'), " +
               "(21, 6, 2, 'Экономичный', 'Сложен в использовании', 'Нам не подошел'), " +
               "(22, 14, 2, 'Удобен в использовании', 'Низкая прочность', 'Лучший из представленных'), " +
               "(22, 4, 3, 'Экономичный', 'Быстро ломается', 'Среднее качество'), " +
               "(22, 6, 2, 'Удобен в использовании', 'Плохая упаковка', 'Среднее качество'), " +
               "(23, 4, 4, 'Удобен в использовании', 'Дороговато', 'Лучший из представленных'), " +
               "(23, 12, 3, 'Экономичный', 'Быстро ломается', 'Лучший из представленных'), " +
               "(23, 7, 2, 'Хороший продукт', 'Сложен в использовании', 'Среднее качество'), " +
               "(23, 13, 5, 'Отличная упаковка', 'Устаревший дизайн', 'Нам не подошел'), " +
               "(23, 3, 5, 'Удобен в использовании', 'Устаревший дизайн', 'Не рекомендую'), " +
               "(23, 2, 4, 'Современный дизайн', 'Быстро ломается', 'Лучший из представленных'), " +
               "(24, 3, 3, 'Экономичный', 'Низкая прочность', 'Отличный товар'), " +
               "(24, 10, 5, 'Хороший продукт', 'Быстро ломается', 'Лучший из представленных'), " +
               "(24, 2, 1, 'Отличная упаковка', 'Сложен в использовании', 'Отличный товар'), " +
               "(24, 5, 1, 'Высокое качество', 'Быстро ломается', 'Отличный товар'), " +
               "(24, 1, 2, 'Удобен в использовании', 'Дороговато', 'Среднее качество'), " +
               "(24, 4, 5, 'Экономичный', 'Сложен в использовании', 'Не рекомендую'), " +
               "(25, 14, 1, 'Современный дизайн', 'Дороговато', 'Отличный товар'), " +
               "(25, 1, 3, 'Удобен в использовании', 'Плохая упаковка', 'Слишком дорого'), " +
               "(25, 7, 4, 'Отличная упаковка', 'Дороговато', 'Отличный товар'), " +
               "(26, 13, 4, 'Отличная упаковка', 'Устаревший дизайн', 'Слишком дорого'), " +
               "(26, 5, 5, 'Высокое качество', 'Низкая прочность', 'Отличный товар'), " +
               "(26, 15, 1, 'Отличная упаковка', 'Быстро ломается', 'Среднее качество'), " +
               "(26, 8, 3, 'Современный дизайн', 'Низкая прочность', 'Отличный товар'), " +
               "(26, 2, 1, 'Хороший продукт', 'Плохая упаковка', 'Не рекомендую'), " +
               "(26, 12, 3, 'Высокое качество', 'Низкая прочность', 'Отличный товар'), " +
               "(27, 6, 3, 'Экономичный', 'Низкая прочность', 'Не рекомендую'), " +
               "(27, 8, 2, 'Экономичный', 'Плохая упаковка', 'Лучший из представленных'), " +
               "(27, 2, 4, 'Удобен в использовании', 'Дороговато', 'Среднее качество'), " +
               "(27, 10, 4, 'Современный дизайн', 'Дороговато', 'Среднее качество'), " +
               "(27, 13, 2, 'Современный дизайн', 'Плохая упаковка', 'Нам не подошел'), " +
               "(27, 15, 1, 'Современный дизайн', 'Плохая упаковка', 'Отличный товар'), " +
               "(27, 3, 5, 'Экономичный', 'Низкая прочность', 'Не рекомендую')" )

        db.execSQL("INSERT INTO Reviews(Products_id, Client_id, Score, Dignities, Disadvantages, Comment) VALUES (28, 3, 4, 'Отличная упаковка', 'Сложен в использовании', 'Не рекомендую'), " +
               "(28, 2, 2, 'Экономичный', 'Дороговато', 'Лучший из представленных'), " +
               "(28, 14, 5, 'Удобен в использовании', 'Дороговато', 'Нам не подошел'), " +
               "(29, 11, 2, 'Удобен в использовании', 'Устаревший дизайн', 'Лучший из представленных'), " +
               "(29, 9, 4, 'Современный дизайн', 'Дороговато', 'Не рекомендую'), " +
               "(29, 13, 2, 'Экономичный', 'Дороговато', 'Лучший из представленных'), " +
               "(29, 3, 2, 'Высокое качество', 'Устаревший дизайн', 'Нам не подошел'), " +
               "(29, 12, 5, 'Высокое качество', 'Дороговато', 'Среднее качество'), " +
               "(30, 5, 5, 'Отличная упаковка', 'Устаревший дизайн', 'Нам не подошел'), " +
               "(30, 13, 4, 'Удобен в использовании', 'Устаревший дизайн', 'Отличный товар'), " +
               "(30, 4, 3, 'Удобен в использовании', 'Устаревший дизайн', 'Среднее качество'), " +
               "(31, 12, 5, 'Современный дизайн', 'Дороговато', 'Отличный товар'), " +
               "(31, 13, 4, 'Удобен в использовании', 'Плохая упаковка', 'Не рекомендую'), " +
               "(31, 7, 4, 'Современный дизайн', 'Устаревший дизайн', 'Среднее качество'), " +
               "(31, 6, 2, 'Удобен в использовании', 'Дороговато', 'Слишком дорого'), " +
               "(32, 4, 5, 'Удобен в использовании', 'Сложен в использовании', 'Слишком дорого'), " +
               "(32, 2, 4, 'Отличная упаковка', 'Сложен в использовании', 'Отличный товар'), " +
               "(32, 6, 1, 'Удобен в использовании', 'Устаревший дизайн', 'Слишком дорого'), " +
               "(33, 8, 3, 'Отличная упаковка', 'Сложен в использовании', 'Нам не подошел'), " +
               "(33, 12, 4, 'Удобен в использовании', 'Низкая прочность', 'Лучший из представленных'), " +
               "(33, 3, 3, 'Экономичный', 'Устаревший дизайн', 'Среднее качество'), " +
               "(33, 11, 5, 'Хороший продукт', 'Дороговато', 'Слишком дорого'), " +
               "(33, 6, 1, 'Хороший продукт', 'Плохая упаковка', 'Отличный товар'), " +
               "(33, 14, 5, 'Современный дизайн', 'Сложен в использовании', 'Лучший из представленных'), " +
               "(33, 9, 1, 'Отличная упаковка', 'Сложен в использовании', 'Слишком дорого'), " +
               "(34, 7, 5, 'Удобен в использовании', 'Дороговато', 'Среднее качество'), " +
               "(34, 8, 4, 'Удобен в использовании', 'Сложен в использовании', 'Не рекомендую'), " +
               "(34, 13, 1, 'Хороший продукт', 'Сложен в использовании', 'Не рекомендую'), " +
               "(34, 3, 3, 'Удобен в использовании', 'Низкая прочность', 'Лучший из представленных'), " +
               "(34, 11, 1, 'Экономичный', 'Устаревший дизайн', 'Среднее качество'), " +
               "(34, 2, 2, 'Отличная упаковка', 'Сложен в использовании', 'Нам не подошел'), " +
               "(35, 1, 4, 'Экономичный', 'Плохая упаковка', 'Не рекомендую'), " +
               "(35, 6, 5, 'Хороший продукт', 'Сложен в использовании', 'Среднее качество'), " +
               "(35, 7, 3, 'Современный дизайн', 'Сложен в использовании', 'Не рекомендую'), " +
               "(35, 9, 4, 'Удобен в использовании', 'Быстро ломается', 'Слишком дорого'), " +
               "(35, 11, 1, 'Экономичный', 'Низкая прочность', 'Отличный товар'), " +
               "(35, 8, 3, 'Отличная упаковка', 'Дороговато', 'Слишком дорого'), " +
               "(35, 14, 5, 'Современный дизайн', 'Плохая упаковка', 'Нам не подошел'), " +
               "(36, 10, 4, 'Удобен в использовании', 'Сложен в использовании', 'Нам не подошел'), " +
               "(36, 14, 1, 'Современный дизайн', 'Сложен в использовании', 'Слишком дорого'), " +
               "(36, 13, 1, 'Экономичный', 'Сложен в использовании', 'Слишком дорого'), " +
               "(36, 1, 2, 'Высокое качество', 'Быстро ломается', 'Не рекомендую'), " +
               "(36, 4, 2, 'Экономичный', 'Дороговато', 'Не рекомендую'), " +
               "(36, 9, 2, 'Хороший продукт', 'Сложен в использовании', 'Нам не подошел'), " +
               "(36, 15, 2, 'Высокое качество', 'Сложен в использовании', 'Отличный товар')" )

        db.execSQL("INSERT INTO Reviews(Products_id, Client_id, Score, Dignities, Disadvantages, Comment) VALUES (37, 14, 5, 'Хороший продукт', 'Устаревший дизайн', 'Лучший из представленных'), " +
               "(37, 9, 2, 'Отличная упаковка', 'Быстро ломается', 'Слишком дорого'), " +
               "(37, 15, 1, 'Удобен в использовании', 'Быстро ломается', 'Не рекомендую'), " +
               "(38, 9, 3, 'Хороший продукт', 'Дороговато', 'Лучший из представленных'), " +
               "(38, 3, 5, 'Отличная упаковка', 'Устаревший дизайн', 'Слишком дорого'), " +
               "(38, 10, 2, 'Хороший продукт', 'Сложен в использовании', 'Среднее качество'), " +
               "(38, 14, 2, 'Хороший продукт', 'Быстро ломается', 'Нам не подошел'), " +
               "(38, 4, 5, 'Высокое качество', 'Сложен в использовании', 'Среднее качество'), " +
               "(38, 8, 5, 'Высокое качество', 'Дороговато', 'Лучший из представленных'), " +
               "(39, 13, 1, 'Высокое качество', 'Дороговато', 'Не рекомендую'), " +
               "(39, 7, 2, 'Отличная упаковка', 'Дороговато', 'Нам не подошел'), " +
               "(39, 1, 2, 'Хороший продукт', 'Низкая прочность', 'Среднее качество'), " +
               "(39, 8, 1, 'Высокое качество', 'Быстро ломается', 'Лучший из представленных'), " +
               "(40, 8, 1, 'Удобен в использовании', 'Быстро ломается', 'Лучший из представленных'), " +
               "(40, 15, 5, 'Хороший продукт', 'Быстро ломается', 'Лучший из представленных'), " +
               "(40, 3, 2, 'Отличная упаковка', 'Сложен в использовании', 'Нам не подошел'), " +
               "(40, 14, 3, 'Удобен в использовании', 'Устаревший дизайн', 'Нам не подошел'), " +
               "(40, 7, 4, 'Удобен в использовании', 'Низкая прочность', 'Не рекомендую'), " +
               "(40, 9, 1, 'Современный дизайн', 'Быстро ломается', 'Слишком дорого'), " +
               "(40, 6, 5, 'Хороший продукт', 'Плохая упаковка', 'Нам не подошел'), " +
               "(41, 2, 4, 'Отличная упаковка', 'Плохая упаковка', 'Не рекомендую'), " +
               "(41, 1, 1, 'Удобен в использовании', 'Низкая прочность', 'Слишком дорого'), " +
               "(41, 3, 3, 'Удобен в использовании', 'Устаревший дизайн', 'Нам не подошел'), " +
               "(42, 12, 2, 'Отличная упаковка', 'Дороговато', 'Нам не подошел'), " +
               "(42, 3, 1, 'Хороший продукт', 'Устаревший дизайн', 'Не рекомендую'), " +
               "(42, 7, 3, 'Высокое качество', 'Быстро ломается', 'Среднее качество'), " +
               "(43, 5, 2, 'Хороший продукт', 'Устаревший дизайн', 'Нам не подошел'), " +
               "(43, 10, 3, 'Современный дизайн', 'Устаревший дизайн', 'Отличный товар'), " +
               "(43, 11, 2, 'Экономичный', 'Устаревший дизайн', 'Нам не подошел'), " +
               "(43, 9, 3, 'Современный дизайн', 'Низкая прочность', 'Нам не подошел'), " +
               "(43, 6, 1, 'Современный дизайн', 'Низкая прочность', 'Нам не подошел'), " +
               "(43, 15, 1, 'Экономичный', 'Устаревший дизайн', 'Лучший из представленных'), " +
               "(44, 3, 4, 'Экономичный', 'Устаревший дизайн', 'Не рекомендую'), " +
               "(44, 12, 5, 'Удобен в использовании', 'Низкая прочность', 'Лучший из представленных'), " +
               "(44, 15, 4, 'Отличная упаковка', 'Плохая упаковка', 'Не рекомендую'), " +
               "(44, 11, 4, 'Удобен в использовании', 'Плохая упаковка', 'Не рекомендую'), " +
               "(44, 1, 2, 'Удобен в использовании', 'Быстро ломается', 'Среднее качество'), " +
               "(44, 4, 1, 'Экономичный', 'Низкая прочность', 'Нам не подошел'), " +
               "(45, 12, 1, 'Высокое качество', 'Быстро ломается', 'Не рекомендую'), " +
               "(45, 1, 3, 'Удобен в использовании', 'Быстро ломается', 'Лучший из представленных'), " +
               "(45, 15, 2, 'Отличная упаковка', 'Дороговато', 'Нам не подошел'), " +
               "(45, 7, 5, 'Современный дизайн', 'Плохая упаковка', 'Нам не подошел')" )

        db.execSQL("INSERT INTO Reviews(Products_id, Client_id, Score, Dignities, Disadvantages, Comment) VALUES (46, 6, 1, 'Экономичный', 'Дороговато', 'Не рекомендую'), " +
               "(46, 3, 5, 'Высокое качество', 'Устаревший дизайн', 'Слишком дорого'), " +
               "(46, 8, 4, 'Экономичный', 'Устаревший дизайн', 'Среднее качество')" )

        db.execSQL("insert into Orders(Clients_id, DeliveryAdresses_id, Date, Time, ContactlessDelivery) values (1, 1, '12.12.2023', '12:00:00', 1)," +
                                                                                                                    "(1, 2, '12.12.2023', '13:00:00', 0)," +
                                                                                                                    "(1, 3, '12.12.2023', '14:00:00', 0)")

        db.execSQL("insert into OrdersProduct(Orders_id, Products_id, Quantity) values (1, 1, 1),"+
                                                        "(2, 2, 1)," +
                                                        "(2, 3, 1)," +
                                                        "(3, 4, 1)," +
                                                        "(3, 5, 1)," +
                                                        "(3, 6, 1)")

        db.execSQL("insert into CartClient(Clients_id, Products_id, Quantity) values (1, 1, 1), (1, 2, 2), (1, 7, 7)")

        db.execSQL("insert into DeliveryDayAndTime(Day, Time) values ('Сегодня', '10:00-13:00')," +
                "('Сегодня','11:00-14:00')," +
                "('Сегодня','12:00-15:00')," +
                "('Сегодня','13:00-16:00')," +
                "('Сегодня','14:00-17:00')," +
                "('Сегодня','15:00-18:00')," +
                "('Сегодня','16:00-19:00')," +
                "('Сегодня','17:00-20:00')," +
                "('Сегодня','18:00-21:00')," +
                "('Сегодня','19:00-22:00')," +
                "('Сегодня','20:00-23:00')," +
                "('Завтра','10:00-13:00')," +
                "('Завтра','11:00-14:00')," +
                "('Завтра','12:00-15:00')," +
                "('Завтра','13:00-16:00')," +
                "('Завтра','14:00-17:00')," +
                "('Завтра','15:00-18:00')," +
                "('Завтра','16:00-19:00')," +
                "('Завтра','17:00-20:00')," +
                "('Завтра','18:00-21:00')," +
                "('Завтра','19:00-22:00')," +
                "('Завтра','20:00-23:00')")

        db.close()
    }
}